/**
 * POST /report-item/faceOrderReport
 * body: { codes: "SF0211917573990", printType: "托运客户联" }
 * 业务取 data.table1[0] 喂给配军运单模板
 */
export const faceOrderReportMock = {
	运单号: 'SF0211917573990',
	开单网点简称: '顺丰大票零担项目部',
	开单网点: '顺丰大票零担项目部',
	发货单位: '深圳市顺丰快运有限公司',
	发货人: '马永权',
	发货人电话: '18520127145',
	发货人手机号: '18520127145',
	回单要求: '签回单',
	回单: '签回单1份',
	交货方式: '送货',
	提货方式: '送货',
	路由目的地: '深圳市-龙岗区',
	中转地: '深圳',
	收货人: '请联系小哥派送',
	收货人电话: '1',
	收货人手机号: '1',
	收货地址:
		'广东省深圳市龙岗区清水片区春霖路37号普洛斯昆明经开(清水)综合产业园A区A01幢1层',
	货名: '食物称',
	品名: '食物称',
	件数: 3,
	包装: '纸箱',
	开单日期: '2026-09-04',
	日期: '2026-09-04',
	合计应收: '210.48',
	费用合计: '210.48',
	付款方式: '月结',
	付款运费: '运费：210.48',
	代收: '0.0',
	代收款: '0.0',
	重量: '1050.0',
	体积: '3.6',
	计费重量: '1102.5',
	计费体积: '3.6',
	打印次数: '1',
	打印操作员: '集团管理员',
	发站电话: '11111111111',
	到站电话: '0769-89397385',
	备注:
		'运营要求：请注意：装卸过程请勿倒置货物;;顺丰静态承诺送达时间：2026-09-04 12:00:00;包仓线路运费待更新,',
	开单备注:
		'运营要求：请注意：装卸过程请勿倒置货物;;顺丰静态承诺送达时间：2026-09-04 12:00:00;包仓线路运费待更新,',
}
