/**
 * POST /report-item/receiptTask
 * body: { codes: "\"SF0211917573990\"" }
 * 回单打印：取 data[0]；O097=2 时走配军模板
 */
export const receiptTaskMock = [
	{
		运单号: 'SF0211917573990',
		回单编号: 'SF0211917573990',
		开单网点简称: '顺丰大票零担项目部',
		开单网点: '顺丰大票零担项目部',
		发货单位: '深圳市顺丰快运有限公司',
		发货人: '马永权',
		发货人电话: '18520127145',
		发货人手机号: '18520127145',
		回单要求: '签回单',
		回单份数: 1,
		签名要求: '',
		交货方式: '送货',
		提货方式: '送货',
		路由目的地: '深圳市-龙岗区',
		中转地: '深圳',
		收货人: '请联系小哥派送',
		收货人电话: '1',
		收货人手机号: '1',
		收货地址:
			'广东省深圳市龙岗区清水片区春霖路37号普洛斯昆明经开(清水)综合产业园A区A01幢1层',
		收货单位: '顺丰协派',
		货名: '食物称',
		品名: '食物称',
		件数: 3,
		包装: '纸箱',
		开单日期: '2026-09-04',
		日期: '2026-09-04',
		合计应收: '210.48',
		费用合计: '210.48',
		付款方式: '月结',
		代收: '0.0',
		代收款: '0.0',
		备注: '签回单',
		开单备注: '签回单',
		计费重量: '1102.5',
		计费体积: '3.6',
	},
]
